{
  "nav_why": "Why",
  "nav_tokenomics": "Tokenomics",
  "nav_roadmap": "Roadmap",
  "nav_how": "How to Buy",
  "nav_contract": "Contract",

  "btn_telegram": "Telegram",
  "btn_trade": "Trade on DEX",
  "btn_buy_on_dex": "Buy on DEX",
  "btn_community": "Community",
  "btn_tokenomics": "Tokenomics",

  "hero_title": "$VIGRI — a token for sports, dance, fans — and everyone who cares",
  "hero_subtitle": "$VIGRI is a utility token on Solana for payments, discounts, and access to services and experiences from sports clubs and dance studios. Part of the Lumiros ecosystem.",
  
  "presale_title": "Presale",
  "live_until": "Live until",
  "accepted": "Accepted",
  "target": "Target",
  "raised": "raised",
  "label_days": "DAYS",
  "label_hours": "HOURS",
  "label_min": "MIN",
  "label_sec": "SEC",
  "join_presale": "Join Presale",
  "read_litepaper": "Read litepaper",
  "numbers_note": "Numbers are indicative; on-chain data will be connected later.",
  "of": "of",

  "why_title": "Why $VIGRI",
  "why_intro": "$VIGRI Platform is where sports clubs and dance studios offer paid services and unique fan experiences powered by $VIGRI. Fans get access to merch, activities, and digital collectibles, while clubs gain a new revenue stream and engagement tools. Club pages host clear offers, transparent infrastructure funding, and $VIGRI payments; active supporters earn status and perks. $VIGRI turns a meme token into a practical tool of support — a simple bridge from Web3 to everyday value.",
  "tokenomics_title": "Tokenomics",
  "how_title": "How to Buy",
  "step": "STEP",
  "how_step1": "Install a wallet: Phantom or Solflare.",
  "how_step2": "Top up SOL to cover fees.",
  "how_step3": "Go to the DEX (Raydium/Orca) via the link below.",
  "how_step4": "Swap SOL → VIGRI and add the token to your wallet.",

  "why_card_payments_title": "Purchases & Payments",
  "why_card_payments_desc": "Fans get fast checkout for merch, passes, and experiences; clubs get instant $VIGRI receipts and transparent accounting.",
  "why_card_passes_title": "Passes & Experiences",
  "why_card_passes_desc": "Tokenized passes and tickets: training sessions, backstage, private meetups, away trips with the team, and more.",
  "why_card_crowd_title": "Crowdfunding & Infrastructure",
  "why_card_crowd_desc": "Transparent funding for training facilities, travel, equipment, and other club development — directly from fans.",
  "why_card_merch_title": "Merch & Collectibles",
  "why_card_merch_desc": "Pre-orders for official club merch and limited digital collectibles.",
  "why_card_status_title": "Status & Recognition",
  "why_card_status_desc": "Active supporters earn titles, badges, and special opportunities — 'Fan of the Month', team shout-outs, community roles, and away-game support.",
  "why_card_clubpages_title": "Club Pages & Offers",
  "why_card_clubpages_desc": "Dedicated pages for each club to publish offers, sell passes & merch, take $VIGRI contributions, and run fan activities.",

  "why_name_title": "Why the name “VIGRI”?",
  "why_name_text": "A gentle nod to 1980 on the Baltic — sailing, fair play, and a friendly spirit of openness and support. We keep the spirit, not any official brand: a warm symbol for fans and clubs.",
  "learn_more": "Learn more",

  "contract_links_title": "Contract & Links",
  "links_title": "Links",
  "mint_title": "Mint (token address)",
  "program_id_title": "Program ID",
  "arweave_title": "Arweave Metadata",
  "link_solscan_token": "Solscan (token)",
  "link_explorer_program": "Solana Explorer (Program)",
  "copy_tooltip": "Click to copy to clipboard",
  "copied_tooltip": "Copied to clipboard",

  "tokenomics_network": "Network",
  "tokenomics_total_supply": "Total supply",
  "tokenomics_tax": "Transaction tax",
  "tokenomics_program": "Program",
  "tokenomics_note": "The distribution mechanics of the tax (marketing/liquidity/development) are enforced by the on-chain program and may be refined during development. Full details will be published in the docs.",

  "disclaimer": "Important: Not investment advice. VIGRI is a utility token; purchases are at your own risk.",
  "why_social_fund": "A share of funds and activity goes to a social fund supporting athletes and clubs in times of crisis.",

  "roadmap_title": "Roadmap (Oct 2025 – Jul 2026)",
  "roadmap_disclaimer": "Timeline is indicative and may shift based on audits, partners, and market conditions.",
  "roadmap_airdrop_note": "“Early Supporters Airdrop” refers to a small allocation for long-time supporters from our legacy community (details in the docs).",
  "roadmap_i1_k": "Oct 2025",
  "roadmap_i1_v": "Devnet finalized; mainnet deploy if stable (mint ↔ program linked). Website v1 (EN). Litepaper & docs live. Early Supporters Airdrop and NFT-based presale (two designs). External crowdfunding campaign on a major platform (time-permitting; otherwise Nov).",
  "roadmap_i2_k": "Nov–Dec 2025",
  "roadmap_i2_v": "Mainnet completion (if needed). Continue presale; launch or advance the external crowdfunding campaign. DEX listing window (Raydium/Orca) with initial liquidity. Results review and brief transparency note on fund use. Prep for platform dev: hiring plan, scope refinement, design prototype.",
  "roadmap_i3_k": "Q1 2026",
  "roadmap_i3_v": "Team formation (Feb–Mar), architecture v0, roadmap decomposition. Clickable UI prototype and technical spikes — no MVP promise in this phase.",
  "roadmap_i4_k": "Jun–Jul 2026",
  "roadmap_i4_v": "Public MVP (subject to funding and team): basic Club Pages and Passes & Experiences v0, limited pilot.",

  "footer_note": "The project is under active development. Content on this site may change without notice. Nothing here constitutes investment advice or an offer to sell securities.",
  "footer_social": "Social",
  "footer_documents": "Documents",
  "footer_legal": "Legal",
  "footer_litepaper_cs": "Litepaper (coming soon)",
  "footer_tokenlist_cs": "Token JSON (for wallets, coming soon)",
  "footer_privacy": "Privacy Policy",
  "footer_terms": "Terms of Use"
}
