{
  "nav_why": "Miks",
  "nav_tokenomics": "Tokenoomika",
  "nav_roadmap": "Teekaart",
  "nav_how": "Kuidas osta",
  "nav_contract": "Leping",

  "btn_telegram": "Telegram",
  "btn_trade": "Kauple DEXis",
  "btn_buy_on_dex": "Osta DEXist",
  "btn_community": "Kogukond",
  "btn_tokenomics": "Tokenoomika",

  "hero_title": "$VIGRI — token spordi, tantsu ja fännide jaoks — kõigile, kellele läheb korda",
  "hero_subtitle": "$VIGRI on Solana utiliit-token maksete, soodustuste ja ligipääsu jaoks spordiklubide ja tantsustuudiote teenustele ning kogemustele. Osa Lumirose ökosüsteemist.",

  "presale_title": "Eelmüük",
  "live_until": "Kuni",
  "accepted": "Aktsepteerime",
  "target": "Eesmärk",
  "raised": "kogutud",
  "label_days": "PÄEV",
  "label_hours": "TUND",
  "label_min": "MIN",
  "label_sec": "SEK",
  "join_presale": "Liitu eelmüügiga",
  "read_litepaper": "Loe litepaperit",
  "numbers_note": "Numbrid on orienteeruvad; on-chain andmed lisanduvad hiljem.",
  "of": "eesmärgist",

  "why_title": "Miks $VIGRI",
  "why_intro": "$VIGRI platvorm on koht, kus spordiklubid ja tantsustuudiod pakuvad tasulisi teenuseid ja ainulaadseid fännikogemusi $VIGRI toel. Fännid saavad ligipääsu merch’ile, tegevustele ja digikogutavatele, klubid aga uue tuluallika ja kaasamisvahendid. Klubi lehtedel on selged pakkumised, läbipaistev infrastruktuuri rahastus ja $VIGRI maksed; aktiivsed toetajad teenivad staatuseid ja soodustusi. $VIGRI muudab meem-tokkeni praktiliseks toetusvahendiks — lihtne sild Web3-st igapäevasesse väärtusesse.",
  "tokenomics_title": "Tokenoomika",
  "how_title": "Kuidas osta",
  "step": "SAMM",
  "how_step1": "Paigalda rahakott: Phantom või Solflare.",
  "how_step2": "Lisa SOL tasude katteks.",
  "how_step3": "Ava DEX (Raydium/Orca) alloleva lingi kaudu.",
  "how_step4": "Vaheta SOL → VIGRI ja lisa token oma rahakotti.",

  "why_card_payments_title": "Ostud ja maksed",
  "why_card_payments_desc": "Fännidel kiire kassasooritus merch’i, passide ja kogemuste jaoks; klubidel kohesed $VIGRI laekumised ja läbipaistev arvestus.",
  "why_card_passes_title": "Pääsmed ja kogemused",
  "why_card_passes_desc": "Tokeniseeritud passid ja piletid: treeningud, backstage, privaatsed kohtumised, välismängude tripid jpm.",
  "why_card_crowd_title": "Ühisrahastus ja infrastruktuur",
  "why_card_crowd_desc": "Läbipaistev rahastus saalidele, sõitudele, varustusele ja klubi arengule — otse fännidelt.",
  "why_card_merch_title": "Merch ja kollektsioneeritavad esemed",
  "why_card_merch_desc": "Eeltellimused ametlikule merch’ile ja piiratud digitaalsetele kollektsioonidele.",
  "why_card_status_title": "Staatus ja tunnustus",
  "why_card_status_desc": "Aktiivsed toetajad teenivad tiitleid, märke ja soodustusi — „Kuu fänn“, tiimi shout-out’id, rollid kogukonnas, tugi välismängudel.",
  "why_card_clubpages_title": "Klubilehed ja pakkumised",
  "why_card_clubpages_desc": "Iga klubi eraldi leht pakkumiste, passide ja merchi müügiga, $VIGRI panustega ja fänni-üritustega.",

  "why_name_title": "Miks nimi “VIGRI”?",
  "why_name_text": "Õrn viide 1980. aastale Läänemerel — purjetamine, fair play ja sõbralik avatuse ning toe vaim. Hoiame alles vaimu, mitte ühtegi ametlikku kaubamärki: soe sümbol fännidele ja klubidele.",
  "learn_more": "Loe lähemalt",

  "contract_links_title": "Leping ja lingid",
  "links_title": "Lingid",
  "mint_title": "Mint (tokeni aadress)",
  "program_id_title": "Programmi ID",
  "arweave_title": "Arweave metaandmed",
  "link_solscan_token": "Solscan (token)",
  "link_explorer_program": "Solana Explorer (programm)",
  "copy_tooltip": "Klõpsa kopeerimiseks lõikelauale",
  "copied_tooltip": "Kopeeritud lõikelauale",

  "tokenomics_network": "Võrk",
  "tokenomics_total_supply": "Kogupakkumine",
  "tokenomics_tax": "Tehingumaks",
  "tokenomics_program": "Programm",
  "tokenomics_note": "Maksu jaotuse mehhanika (turundus/likviidsus/arendus) on rakendatud ahelas töötava programmiga ning seda võidakse arenduse käigus täpsustada. Täielikud üksikasjad avaldatakse dokumentatsioonis.",

  "disclaimer": "Tähtis: see ei ole investeerimisnõuanne. VIGRI on utiliit-token; ostud teete omal vastutusel.",
  "why_social_fund": "Osa vahenditest ja tegevusest läheb sotsiaalfondi, mis toetab sportlasi ja klubisid kriisiaegadel.",

  "roadmap_title": "Teekaart (okt 2025 – juuli 2026)",
  "roadmap_disclaimer": "Ajajoon on indikatiivne ja võib muutuda auditite, partnerite ja turutingimuste tõttu.",
  "roadmap_airdrop_note": "“Early Supporters Airdrop” tähendab väikest jaotust meie pikaajalistele toetajatele varasemast kogukonnast (detailid dokumentatsioonis).",
  "roadmap_i1_k": "okt 2025",
  "roadmap_i1_v": "Devnet lõpetatud; mainneti juurutus stabiilsuse korral (mint ↔ programm seotud). Veebileht v1 (EN). Litepaper ja dokid avalikud. Early Supporters airdrop (Early Supporters Airdrop) ja NFT-põhine presale (kaks disaini). Väline ühisrahastus suurel platvormil (kui jõuame; vastasel juhul novembris).",
  "roadmap_i2_k": "nov–dets 2025",
  "roadmap_i2_v": "Mainneti lõpetamine (vajadusel). Presale jätkub; ühisrahastuse kampaania käivitamine või edendamine. DEX-i (Raydium/Orca) noteerimisaken algse likviidsusega. Tulemuste ülevaade ja lühike läbipaistvuse märkus vahendite kasutuse kohta. Platvormiarenduse ettevalmistus: värbamisplaan, ulatuse täpsustamine, disainprototüüp.",
  "roadmap_i3_k": "I kv 2026",
  "roadmap_i3_v": "Meeskonna loomine (veebr–märts), arhitektuur v0, teekaardi lahtikirjutus. Klikitav UI-prototüüp ja tehnilised katsetused (spike’id) — selles faasis MVP lubadust ei anna.",
  "roadmap_i4_k": "juuni–juuli 2026",
  "roadmap_i4_v": "Avalik MVP (sõltub rahastusest ja meeskonnast): baasilised Club Pages ning Passes & Experiences v0, piiratud piloot.",

  "footer_note": "Projekt on aktiivses arenduses. Sellel saidil olev sisu võib muutuda ilma ette teatamata. Siinne teave ei ole investeerimisnõuanne ega väärtpaberite müügi- või ostupakkumine.",
  "footer_social": "Sotsiaalmeedia",
  "footer_documents": "Dokumendid",
  "footer_legal": "Õiguslik",
  "footer_litepaper_cs": "Litepaper (peagi)",
  "footer_tokenlist_cs": "Tokeni JSON (rahakottidele, peagi)",
  "footer_privacy": "Privaatsuspoliitika",
  "footer_terms": "Kasutustingimused"
}
